<!-- dflook/terraform-github-actions {"workspace":"default","backend":"2a0d6eafdf8e90703908d30238e3dd4bff9fa4b004691860430de30bb61adff4","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #293 at https://github.com/dflook/terraform-github-actions/actions/runs/3547050494","plan_hash":"cec89799aad0f51ded555a5dbe996a2a806f57b9779ec285f92477b1a03a99fd","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "O0eigNt5xt" -> (known after apply)
  ~ foreach = "gNk0gr6AOi" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #293](https://github.com/dflook/terraform-github-actions/actions/runs/3547050494)